Revit 2024 API
ParameterTypeId.StructuralDisplayInHiddenViewsColumn Property
 "Display in Hidden Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralDisplayInHiddenViewsColumn { get; }
Visual Basic
Public Shared ReadOnly Property StructuralDisplayInHiddenViewsColumn As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralDisplayInHiddenViewsColumn {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace